{
	"_meta": {
		"sources": [
			{
				"json": "AdditionalFey",
				"abbreviation": "AF",
				"full": "Additional Fey",
				"url": "",
				"authors": [
					"Erikku Blade"
				],
				"convertedBy": []
			}
		],
		"dateAdded": 1589100518,
		"dateLastModified": 1589100518
	},
	"spell": [
		{
			"name": "Faenatics",
			"source": "AdditionalFey",
			"page": 2,
			"level": 1,
			"school": "I",
			"time": [
				{
					"number": 1,
					"unit": "action"
				}
			],
			"range": {
				"type": "point",
				"distance": {
					"type": "sight"
				}
			},
			"components": {
				"s": true
			},
			"duration": [
				{
					"type": "timed",
					"duration": {
						"type": "hour",
						"amount": 1,
						"upTo": true
					},
					"concentration": true
				}
			],
			"entries": [
				"You implant illusory sounds or images to a creature you can see.",
				"Choose a creature within range, that target makes a wisdom saving throw. On a failed save, You can apply one or more of the following effects to that creature up to a number equal to the spell level:",
				"Paranoia. The target becomes paranoid as they believe someone is following them. They see glimpses of a rogue-like figure, but never see their face and any attempt to get close to the figure fails. The creature is {@condition frightened} until the spell ends.",
				"Whispers. The target is bombarded with lots of whispering. They cannot understand what the whispers are saying, but all other noises are completely masked by these whispers. The target is {@condition deafened} until the spell ends.",
				"Tumbling Foolery. The target's sense of balance becomes skewered and they become dizzy. Until the spell ends, they have disadvantage on dexterity ability checks and saving throws and their speed is cut in half. In addition, when they fail a dexterity ability check, they roll a {@dice d20}. On a 1, they fall {@condition prone}. A {@condition prone} creature with this effect uses their full movement to stand up.",
				"Unusual Perception. Until the spell ends, the target can see into the ethereal plane. However, in addition to the creatures on the ethereal plane, they also see weird fey-like creatures doing crazy stunts. The target has disadvantage on Wisdom (Perception) and Intelligence (Investigation) checks, as their vision is mostly blocked by these ethereal visions.",
				"Love at First Sight. Until the spell ends, the target becomes {@condition charmed} by the next creature it sees. While {@condition charmed}, they become extremely infatuated with that creature regardless of their original preferences. They will do anything that creature asks of them to the best of their ability in an attempt to impress them. Once the spell ends, the creature knows it was {@condition charmed}, but not by whom.",
				"Mild Insanity. The target begins to lose perception of reality. Whenever they look at a creature, something is different about them. Whether their skin color is a bright, dark, or colorful, their ears are longer or shorter than they should be, or perhaps one eye is lopsided when it shouldn't be, etc. The target then becomes confused and believes that they've always been like that. Until the spell ends, they have disadvantage on Charisma checks.",
				"Tipsy. Until the spell ends, the target becomes intoxicated. If the creature is immune to poison, this has no effect.",
				"The spell ends early if they can succeed on an Intelligence (Investigation) check against your spell save DC, however the target is not initially aware of the spells effects until after they end. A different creature can spend their action to try and convince the target that they are under the effects of a spell, which requires a successful Charisma (Persuasion) check against your spell save DC."
			],
			"entriesHigherLevel": [
				{
					"name": "At Higher Levels",
					"entries": [
						"When you cast this spell using a spell slot of 2nd level or higher, the amount of creatures you can target increases by one for every two slot levels above 1st."
					]
				}
			],
			"conditionInflict": [
				"frightened",
				"deafened",
				"charmed"
			],
			"savingThrow": [
				"wisdom"
			],
			"miscTags": [
				"HL",
				"SGT"
			],
			"areaTags": [
				"ST"
			],
			"classes": {
				"fromClassList": [
					{
						"name": "Bard",
						"source": "PHB"
					},
					{
						"name": "Druid",
						"source": "PHB"
					},
					{
						"name": "Fate Weaver",
						"source": "fateweaver"
					},
					{
						"name": "Wizard",
						"source": "PHB"
					}
				],
				"fromSubclass": [
					{
						"class": {
							"name": "Cleric",
							"source": "PHB"
						},
						"subclass": {
							"name": "Nature",
							"source": "PHB"
						}
					},
					{
						"class": {
							"name": "Paladin",
							"source": "PHB"
						},
						"subclass": {
							"name": "Ancients",
							"source": "PHB"
						}
					},
					{
						"class": {
							"name": "Ranger",
							"source": "PHB"
						},
						"subclass": {
							"name": "Fey Wanderer (UA)",
							"source": "UA2020SubclassesPt3"
						}
					},
					{
						"class": {
							"name": "Warlock",
							"source": "PHB"
						},
						"subclass": {
							"name": "Archfey",
							"source": "PHB"
						}
					}
				]
			},
			"uniqueId": "14da729f3693fb859c8f0c4bc3946ced"
		}
	]
}