{
  "_meta": {
    "sources": [
      {
        "json": "DW",
        "abbreviation": "DW",
        "full": "Dragon Warrior",
        "authors": [
          "Erikku Blade"
        ],
        "convertedBy": [
          "CrimtaneCreeper",
          "Eriku Blade"
        ],
        "version": "3.0",
        "url": "",
        "targetSchema": "1.0.0"
      }
    ]
  },
  "class": [
    {
      "name": "Dragon Warrior",
      "source": "DW",
      "hd": {
        "number": 1,
        "faces": 12
      },
      "proficiency": [
        "con",
        "cha"
      ],
      "classTableGroups": [
        {
          "colLabels": [
            "Draconian Powers"
          ],
          "rows": [
            [
              "-"
            ],
            [
              2
            ],
            [
              2
            ],
            [
              3
            ],
            [
              3
            ],
            [
              4
            ],
            [
              4
            ],
            [
              5
            ],
            [
              5
            ],
            [
              6
            ],
            [
              6
            ],
            [
              7
            ],
            [
              7
            ],
            [
              8
            ],
            [
              8
            ],
            [
              9
            ],
            [
              9
            ],
            [
              10
            ],
            [
              10
            ],
            [
              11
            ]
          ]
        }
      ],
      "startingProficiencies": {
        "armor": [
          "light",
          "medium",
          "heavy",
          "shields"
        ],
        "weapons": [
          "simple",
          "martial"
        ],
        "tools": [
          ""
        ],
        "skills": [
          {
            "choose": {
              "from": [
                "Acrobatics",
                "Arcana",
                "Athletics",
                "History",
                "Insight",
                "Intimidation",
                "Nature",
                "Perception",
                "Stealth"
              ],
              "count": 2
            }
          }
        ]
      },
      "startingEquipment": {
        "additionalFromBackground": true,
        "default": [
          "(a) a longsword OR (b) any martial weapon",
          "(a) an Explorer’s Pack OR (b) a Dungeoneer’s Pack",
          "(a) an Arcane Focus OR (b) any simple weapon",
          "(a) scale mail OR (b) leather armor"
        ],
        "goldAlternative": "5d4x10"
      },
      "multiclassing": {
        "requirements": {
          "cha": 13,
          "or": [
            {
              "dex": 13,
              "str": 13
            }
          ]
        },
        "proficienciesGained": {}
      },
      "classFeatures": [
        [
          {
            "name": "Draconian Origins",
            "entries": [
              "Beginning at 1st level, you have draconic blood running through your veins as part of your draconic inheritance. You gain the following benefits:",
              "You learn how to speak, read, and write draconic. If you already have draconic from another source, you can choose one other language.",
              "Choose either chromatic or metallic, then choose from either black, blue, green, red, or white for chromatic. Brass, bronze, copper, gold, or silver for metallic. These determine your draconic origin, what type of dragon is responsible for your powers, and what type of scales riddle your body.",
              "Depending on your choice, you gain resistance to a specific damage type. ",
              {
                "type": "table",
                "caption": "Draconic Ancestry",
                "colLabels": [
                  "Type",
                  "Damage Resistance"
                ],
                "rows": [
                  [
                    "Brass, Gold, Red",
                    "Fire"
                  ],
                  [
                    "Silver, White",
                    "Cold"
                  ],
                  [
                    "Black, Copper",
                    "Acid"
                  ],
                  [
                    "Blue, Bronze",
                    "Lightning"
                  ],
                  [
                    "Green",
                    "Poison"
                  ]
                ]
              },
              "If you chose metallic, you gain proficiency in your choice of either an artisan’s tool or a musical instrument.",
              "If you chose chromatic, you gain proficiency in one of the following skills: deception, intimidation, performance, or persuasion."
            ]
          },
          {
            "name": "Draconian Body",
            "entries": [
              "Your body is riddled with dragon-like scales, granting you natural armor. While you are not wearing armor your AC equals 13 + your constitution modifier. You can still gain the benefits of a shield."
            ]
          }
        ],
        [
          {
            "name": "Draconian Powers",
            "entries": [
              "Also at 2nd level you learn the ancient secrets of dragons. You know how they can fly, shoot fire - lighting - acid - even frost out of their mouths. You start off with 2 Draconian Powers and gain more as shown in the Dragon Warrior table. Some Draconian Powers are locked away by prerequisites that must be met before they obtain any of these sacred powers such as level and Draconian Origins. You can exchange a Draconian Power for others every time you level up."
            ]
          }
        ],
        [
          {
            "name": "Draconian Archetype"
          },
          {
            "name": "Draconian Archetype Feature",
            "entries": [
              "At 3rd level, you gain a feature from your chosen Draconian Archetype"
            ],
            "gainSubclassFeature": true
          }
        ],
        [
          {
            "name": "Ability Score Improvement",
            "entries": [
              "When you reach 4th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
              "If your DM allows the use of feats, you may instead take a feat."
            ]
          }
        ],
        [
          {
            "name": "Extra Attack",
            "entries": [
              "Starting at 5th level, when you take the attack action on your turn you can make an additional weapon attack. "
            ]
          }
        ],
        [
          {
            "name": "Ability Score Improvement",
            "entries": [
              "When you reach 6th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
              "If your DM allows the use of feats, you may instead take a feat."
            ]
          }
        ],
        [
          {
            "name": "Draconian Archetype Feature",
            "entries": [
              "At 7th level, you gain a feature from your chosen Draconian Archetype"
            ],
            "gainSubclassFeature": true
          }
        ],
        [
          {
            "name": "Ability Score Improvement",
            "entries": [
              "When you reach 8th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
              "If your DM allows the use of feats, you may instead take a feat."
            ]
          }
        ],
        [],
        [
          {
            "name": "Draconian Archetype Feature",
            "entries": [
              "At 10th level, you gain a feature from your chosen Draconian Archetype"
            ],
            "gainSubclassFeature": true
          }
        ],
        [],
        [
          {
            "name": "Ability Score Improvement",
            "entries": [
              "When you reach 12th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
              "If your DM allows the use of feats, you may instead take a feat."
            ]
          }
        ],
        [],
        [
          {
            "name": "Draconian Archetype Feature",
            "entries": [
              "At 15th level, you gain a feature from your chosen Draconian Archetype"
            ],
            "gainSubclassFeature": true
          }
        ],
        [],
        [
          {
            "name": "Ability Score Improvement",
            "entries": [
              "When you reach 16th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
              "If your DM allows the use of feats, you may instead take a feat."
            ]
          }
        ],
        [],
        [
          {
            "name": "Draconian Archetype Feature",
            "entries": [
              "At 18th level, you gain a feature from your chosen Draconian Archetype"
            ],
            "gainSubclassFeature": true
          }
        ],
        [
          {
            "name": "Ability Score Improvement",
            "entries": [
              "When you reach 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
              "If your DM allows the use of feats, you may instead take a feat."
            ]
          }
        ],
        [
          {
            "name": "Draconian Archetype Feature",
            "entries": [
              "At 20th level, you gain a feature from your chosen Draconian Archetype"
            ],
            "gainSubclassFeature": true
          }
        ]
      ],
      "subclassTitle": "Draconian Archetype",
      "subclasses": [
        {
          "name": "Summoner",
          "subclassFeatures": [
            [
              {
                "name": "Summoner",
                "entries": [
                  "Draconic blood flowing through your veins may not be enough. Sometimes, you need an extra set of hands, or claws rather. In addition to draconic blood, you have a dragon’s soul intertwined with yours. Realizing the hidden power within your soul, you can call upon that soul and magically create a companion that is a manifestation of the draconic soul within you."
                ]
              },
              {
                "name": "Manifest Dragon",
                "entries": [
                  "Starting at 3rd level, as an action you can manifest a magical dragon to aid you in battle. Use the “Magen Dragon” stat block. In addition to being a construct, the creature is also treated as a dragon. The manifested dragon shares its initiative with you and it can move, but it cannot use any of its actions on its own. You can command it as a bonus action, allowing it to use one of its actions. This command can be either mentally given, or verbally. Being a construct, the dragon cannot receive healing from any sources unless it can otherwise affect constructs.",
                  "The manifested dragon uses your proficiency bonus rather than its own and its armor class is 13 plus its constitution. Each time you manifest the dragon, you either roll its hit point formula or take the average.",
                  "Once your manifested dragon is reduced to 0 hit points, it is destroyed and cannot be manifested again until you finish a long rest. Alternatively, during a short you can spend half of your hit dice to manifest your dragon, however its hit points are halved. Once you do so, you cannot do so again until you finish a long rest."
                ]
              },
              {
                "name": "Unleash Draconic Fury",
                "entries": [
                  "Also at 3rd level, when you take the attack action while your dragon is manifested, your dragon can make an additional melee attack against a creature within 5 ft of it. You have a number of uses of this feature equal to your Charisma Modifier, and regain all expended uses after a short rest or long rest."
                ]
              }
            ],
            [
              {
                "name": "Greater Manifestation",
                "entries": [
                  "At 7th level, your manifested dragon has now become stronger and is a more viable asset. The dragon can freely act on its own and no longer requires to be commanded to use one of its actions. Its size increases to large and can speak, read, and write common and draconic. If you spend 8 hours training your dragon, it can learn an additional language, but only if you know the language yourself.",
                  "It can now attack twice using any combination of its bite, claws, or tail, but can only bite once. Its breath weapon’s damage increases by 2d6 and the range of its cone increases by 15 ft.",
                  "Its hit dice increases from a d6 to a d8 and each of its ability scores increases by 2. It also gains 2 additional hit dice.",
                  "Its walking speed increases by 10 ft and its flying speed increases by 20 ft."
                ]
              }
            ],
            [
              {
                "name": "Shared Mind of the Drakes",
                "entries": [
                  "At 10th level, you can now link with your manifested dragon’s senses. You can temporarily transfer your consciousness to your manifested dragon. As an action, you can see through your dragon's eyes and hear through its ears. During this time, you are deafened and blinded. You can sustain this effect for up to 10 minutes, and you can end it at any time (requires no action). ",
                  "If you or your dragon takes damage, you must make a concentration check as if you were concentrating on a spell. If you fail, this effect ends and your senses are returned to normal."
                ]
              }
            ],
            [
              {
                "name": "Superior Manifestation",
                "entries": [
                  "At 14th level, your manifested dragon has reached its adulthood and is now a fierce foe in combat. Its size becomes huge and each of its attacks deals an additional damage die. Its bite attack also deals an additional 2d10 damage corresponding to its breath weapon.",
                  "It can now attack three times using any combination of its bite, claws, or tail, but can only bite once. Its breath weapon’s damage increases by 2d6 and the range of its cone increases by 30 ft.",
                  "Its hit dice increases from a d8 to a d10 and each of its ability scores increases by 3. It also gains 3 additional hit dice.",
                  "Its walking speed increases by 10 ft and its flying speed increases by 20 ft."
                ]
              }
            ],
            [
              {
                "name": "Mournful Sacrifice",
                "entries": [
                  "At 18th level, if you were to die by any means while your dragon is manifested, you can instantly destroy your manifestation and expend all remaining uses of your Manifest Dragon feature to avoid dying. When you do so, you are brought to your feet at 1 hit point instead.",
                  "Sacrificing your dragon in this way leaves a scar on your magical ability to manifest it.",
                  "The first time your manifested dragon is destroyed in this manner, you cannot summon it again under any circumstance for 7 days. Each time afterward increases the amount of time by an additional 7 days, up until after the third time you’ve done so. In which case, if it is destroyed in this way again, you cannot summon it again by any means. Only a wish spell can restore your ability to manifest your dragon, upon which you can use this feature once before you lose the ability to manifest it again under the same means."
                ]
              }
            ],
            [
              {
                "name": "Supreme Manifestation",
                "entries": [
                  "At 20th level, your dragon has reached its peak potential and is now your most powerful ally. Its size becomes gargantuan and deals twice as much damage to structures and objects. Each of its attacks deals an additional damage die, and its extra damage for its bite becomes 3d10 instead of 2d10.",
                  "It can make four attacks using any combination of its bite, claws, and tail but can only bite once. Its breath weapon’s damage increases by 4d6 and the range of its cone increases by 30 ft.",
                  "Its hit dice increases from a d10 to a d12 and each of its ability scores increases by 4. It also gains 4 additional hit dice.",
                  "You can manifest your dragon twice before completing a long rest instead of once, but you can only have one dragon manifested at a time."
                ]
              }
            ]
          ],
          "source": "DW",
          "shortName": "Summoner"
        },
        {
          "name": "Invoker",
          "subclassTableGroups": [
            {
              "subclasses": [
                {
                  "name": "Invoker",
                  "source": "DW"
                }
              ],
              "colLabels": [
                "{@filter Cantrips Known|spells|level=0|class=Sorcerer}"
              ],
              "rows": [
                [
                  0
                ],
                [
                  0
                ],
                [
                  2
                ],
                [
                  2
                ],
                [
                  2
                ],
                [
                  2
                ],
                [
                  2
                ],
                [
                  2
                ],
                [
                  2
                ],
                [
                  3
                ],
                [
                  3
                ],
                [
                  3
                ],
                [
                  3
                ],
                [
                  3
                ],
                [
                  3
                ],
                [
                  3
                ],
                [
                  3
                ],
                [
                  3
                ],
                [
                  3
                ],
                [
                  3
                ]
              ]
            },
            {
              "title": "Spell Slots per Spell Level",
              "subclasses": [
                {
                  "name": "Invoker",
                  "source": "DW"
                }
              ],
              "colLabels": [
                "{@filter 1st|spells|level=1|class=Sorcerer}",
                "{@filter 2nd|spells|level=2|class=Sorcerer}",
                "{@filter 3rd|spells|level=3|class=Sorcerer}",
                "{@filter 4th|spells|level=4|class=Sorcerer}"
              ],
              "rows": [
                [
                  0,
                  0,
                  0,
                  0
                ],
                [
                  0,
                  0,
                  0,
                  0
                ],
                [
                  0,
                  0,
                  0,
                  0
                ],
                [
                  3,
                  0,
                  0,
                  0
                ],
                [
                  3,
                  0,
                  0,
                  0
                ],
                [
                  3,
                  0,
                  0,
                  0
                ],
                [
                  4,
                  2,
                  0,
                  0
                ],
                [
                  4,
                  2,
                  0,
                  0
                ],
                [
                  4,
                  2,
                  0,
                  0
                ],
                [
                  4,
                  3,
                  0,
                  0
                ],
                [
                  4,
                  3,
                  0,
                  0
                ],
                [
                  4,
                  3,
                  0,
                  0
                ],
                [
                  4,
                  3,
                  2,
                  0
                ],
                [
                  4,
                  3,
                  2,
                  0
                ],
                [
                  4,
                  3,
                  2,
                  0
                ],
                [
                  4,
                  3,
                  3,
                  0
                ],
                [
                  4,
                  3,
                  3,
                  0
                ],
                [
                  4,
                  3,
                  3,
                  0
                ],
                [
                  4,
                  3,
                  3,
                  1
                ],
                [
                  4,
                  3,
                  3,
                  1
                ]
              ]
            },
            {
              "subclasses": [
                {
                  "name": "Invoker",
                  "source": "DW"
                }
              ],
              "colLabels": [
                "Spells Known"
              ],
              "rows": [
                [
                  0
                ],
                [
                  0
                ],
                [
                  3
                ],
                [
                  4
                ],
                [
                  4
                ],
                [
                  4
                ],
                [
                  5
                ],
                [
                  6
                ],
                [
                  6
                ],
                [
                  7
                ],
                [
                  8
                ],
                [
                  8
                ],
                [
                  9
                ],
                [
                  10
                ],
                [
                  10
                ],
                [
                  11
                ],
                [
                  11
                ],
                [
                  11
                ],
                [
                  12
                ],
                [
                  13
                ]
              ]
            }
          ],
          "subclassFeatures": [
            [
              {
                "name": "Spellcasting",
                "entries": [
                  "When you reach 3rd level, you have discovered an ancient heritage of magical prowess and have gained the ability to cast spells. See chapter 10 for the general rules of spellcasting and chapter 11 for the sorcerer spell list."
                ]
              },
              {
                "name": "Spellcasting",
                "entries": [
                  "When you reach 3rd level, you have discovered an ancient heritage of magical prowess and have gained the ability to cast spells. See chapter 10 for the general rules of spellcasting and chapter 11 for the sorcerer spell list.",
                  {
                    "type": "entries",
                    "name": "Cantrips",
                    "entries": [
                      "You learn two cantrips of your choice from the sorcerer spell list. You learn an additional sorcerer cantrip of your choice at 10th level."
                    ]
                  },
                  {
                    "type": "entries",
                    "name": "Preparing and Casting Spells",
                    "entries": [
                      "The Invoker Spellcasting table shows how many spell slots you have to cast your sorcerer spells of 1st level and higher. To cast one of these spells, you must expend a slot of the spell's level or higher. You regain all expended spell slots when you finish a long rest.\nFor example, if you know the 1st-level spell shield and have a 1st-level and a 2nd-level spell slot available, you can cast shield using either slot.",
                      "Spells Known of 1st-Level and Higher. You know three 1st-level sorcerer spells of your choice.\nThe Spells Known column of the Invoker Spellcasting table shows when you learn more sorcerer spells of 1st level or higher. Each of these spells must be an abjuration or evocation spell of your choice, and must be of a level for which you have spell slots. For instance, when you reach 7th level in this class, you can learn one new spell of 1st or 2nd level.",
                      "Whenever you gain a level in this class, you can replace one of the sorcerer spells you know with another spell of your choice from the sorcerer spell list. The new spell must be of a level for which you have spell slots."
                    ]
                  },
                  {
                    "type": "entries",
                    "name": "Spellcasting Ability",
                    "entries": [
                      "Charisma is your spellcasting ability for your sorcerer spells, since you learn your spells through supernatural powers. You use your Charisma whenever a spell refers to your spellcasting ability. In addition, you use your Charisma modifier when setting the saving throw DC for a sorcerer spell you cast and when making an attack roll with one.\nSpell save DC = 8 + your proficiency bonus + your Charisma modifier\nSpell attack modifier = your proficiency bonus + your Charisma modifier",
                      {
                        "type": "abilityDc",
                        "name": "Spell",
                        "attributes": [
                          "cha"
                        ]
                      }
                    ]
                  }
                ]
              },
              {
                "name": "Invoke Energy",
                "entries": [
                  "At 3rd level, you have a pool of Invoke Energy equal to your Dragon Warrior level, you regain spent invoke energy after a long rest. You learn two invocations that you can spend invoke energy and a bonus action to use them:",
                  {
                    "type": "options",
                    "entries": [
                      {
                        "type": "entries",
                        "name": "Draconic Arms",
                        "entries": [
                          "By spending 1 invoke energy, you morph your arms and hands into dragon-like appendages. You gain a natural weapon in the form of claws. These claws use strength for your attack and damage rolls and deal 2d6 slashing damage on hit. You can make an attack using these claws as part of this bonus action. This invocation lasts for 1 minute, after which your appendages return to normal."
                        ]
                      },
                      {
                        "type": "entries",
                        "name": "Draconic Legs",
                        "entries": [
                          "By spending 1 invoke energy, you morph your legs and feet into dragon-like appendages. Your movement speed increases by 10 ft and you can take the dash action as a bonus action. You can take the dash action as part of this bonus action. This invocation lasts for 1 minute, after which your appendages return to normal."
                        ]
                      }
                    ]
                  }
                ]
              }
            ],
            [
              {
                "name": "Additional Invocations",
                "entries": [
                  "At 7th level you can choose one of the following invocations to learn, you learn another invocation at 15th and 20th levels:",
                  {
                    "type": "options",
                    "entries": [
                      {
                        "type": "entries",
                        "name": "Draconic Build",
                        "entries": [
                          "As an action, you can spend 2 invoke energy to morph your torso into a more draconic-like one. The scales you have become more defined and you become more durable. Your armor class increases by 2 and you gain 10 temporary hit points. If you are hit with a melee attack while you have these temporary hit points, the attacker takes 10 points of damage. This damage is correspondent to the damage you resist from your Draconic Origins. This invocation lasts for 1 minute, or until you lose these temporary hit points, after which your torso returns to normal. You can spend an additional 2 invoke energy to increase the temporary hit points and damage by 10, but the duration of the invocation is halved."
                        ]
                      },
                      {
                        "type": "entries",
                        "name": "Draconic Eyes",
                        "entries": [
                          "As a bonus action, you can spend 2 invoke energy to morph your head into a dragon’s head. During which time your darkvision is increased by 60 ft and you gain a blindsight of 10 ft. You can also see into the ethereal plane and see invisible creatures and objects. They appear as if they were ethereal outlines. This invocation lasts for 1 minute, after which your head returns to normal. You can spend an additional 2 invoke energy to double the range of this increase, but the duration of the invocation is halved."
                        ]
                      },
                      {
                        "type": "entries",
                        "name": "Dragonfire",
                        "entries": [
                          "As a bonus action you can spend 2 invoke energy, dragonfire erupts from a weapon you choose. That weapon deals an additional 1d6 damage, this damage corresponds to the damage you resist from your Draconic Origins. This invocation lasts for 1 minute, or until you end it as a bonus action. You can make a single weapon attack as part of this bonus action. You can spend 2 additional invoke energy to boost the dragonfire’s damage by an additional d6, but the duration of the invocation is halved."
                        ]
                      }
                    ]
                  }
                ]
              }
            ],
            [
              {
                "name": "Invoke Element",
                "entries": [
                  "Starting at 10th level, when you roll acid, cold, fire, lightning, or poison damage, you can spend 1 Invoke Energy to replace that damage type with a different type from the same list."
                ]
              }
            ],
            [
              {
                "name": "Adept Invocations",
                "entries": [
                  "At 14th level, whenever you would spend invoke energy to boost an invocation, you can choose not to spend the extra energy and still gain the boost. You can do so a number of times equal to your Charisma modifier and regain spent uses after a long rest."
                ]
              }
            ],
            [
              {
                "name": "Invoke Arcane",
                "entries": [
                  "At 18th level, you add your spellcasting ability modifier to the damage of your spells. In addition, you can spend any number of invoke energy to re-roll the same number of damage dice for a spell that deals damage. You must use the new result, even if it is lower than the original."
                ]
              }
            ],
            [
              {
                "name": "Invoke Control",
                "entries": [
                  "At 20th level, when you roll initiative with no invoke energy, you regain 5. In addition, when you finish a short rest you replenish half of your invoke energy.",
                  "Also, whenever you use your action or bonus action to spend invoke energy, you can immediately cast a spell with the same casting time as the action you used. You can only do so once per round."
                ]
              }
            ]
          ],
          "source": "DW",
          "shortName": "Invoker"
        },
        {
          "name": "Runic Scribe",
          "subclassFeatures": [
            [
              {
                "name": "Runic Scribe",
                "entries": [
                  "With the ancient power of draconic runes, these dragon warriors tattoo themselves with unwieldy magic. They learn these ancient runes as they grow stronger and are passed on to them from the knowledge of their ancestors. Awaken the truths behind your draconic origins and learn the ancient ways."
                ]
              },
              {
                "name": "Runic Tattoos",
                "entries": [
                  "Starting at 3rd level, magic runes appear on your person. These runes represent an ancient dialect of old draconic. If it is relevant for your campaign, you learn of the oldest form of draconic, predating the one currently being used. These runes hold significant power represented by long forgotten old magicks. Choose one of the following runes:",
                  {
                    "type": "options",
                    "entries": [
                      {
                        "name": "Rune of Power",
                        "entries": [
                          "You’ve harnessed the power of the old magicks and can release outward a blast of arcane energy. You learn the Eldritch Blast cantrip and can cast it using Charisma as your spellcasting ability modifier. You also add your spellcasting ability modifier to the damage of this cantrip. Instead of green eldritch energy, the beam takes the form of wispy dragon-like flames more akin to a dragon’s breath weapon.",
                          "As an action, you can invoke a more latent power of the rune, granting you a boon of untapped power. Your charisma score increases by 2 to a maximum of 22. Any time after you cast the Eldritch Blast cantrip while the boon is invoked, each beam deals an additional 1d10 damage. This boon lasts for 1 hour, after which you cannot invoke the power of this rune again for 7 days."
                        ]
                      },
                      {
                        "name": "Rune of Knowledge",
                        "entries": [
                          "You’ve gained a rune that grants you knowledge of the ancient world. During a short rest, you can spend 10 minutes meditating, reminiscing of the past. When you do so, you can learn of old techniques used for modern items. You gain proficiency in one tool or skill of your choosing. Your proficiency bonus is doubled for any ability check you make that uses this tool or skill. You lose proficiency in this skill if you use this feature again, or when you complete a long rest.",
                          "As an action, you can invoke a more latent power of the rune, granting you a boon of untapped knowledge. Your Intelligence score increases by 2 to a maximum of 22. While the boon is invoked, each time you roll an ability check that doesn’t add your proficiency bonus using Intelligence, you add half of your proficiency bonus to that check. This boon lasts for 1 hour, after which you cannot invoke the power of this rune again for 7 days."
                        ]
                      },
                      {
                        "name": "Rune of Draconic Weaponry",
                        "entries": [
                          "Instead of being scribed on your person, you can scribe this rune onto a weapon of your choosing. That weapon becomes enhanced by the rune’s ancient magic, allowing it to take a more draconic-like appearance riddled with scales. ",
                          "The weapon becomes magical for the purposes of overcoming non-magical resistances if it wasn’t magical already. In addition to the weapon’s normal damage, it also gains a bonus 1d6 damage corresponding to the damage type you resist from your Draconic Origins. This bonus damage increases to 1d8 at level 5, 1d10 at level 11, and 1d12 at level 17. You can only have one weapon inscribed with this rune’s magic at a time.",
                          "As an action, you can invoke a more latent power of the rune, granting you a boon of untapped strength. Your strength score increases by 2 to a maximum of 22. You have advantage on all weapon attacks made with a weapon etched with this rune. This boon lasts for 1 hour, after which you cannot invoke the power of this rune again for 7 days."
                        ]
                      }
                    ]
                  }
                ]
              }
            ],
            [
              {
                "name": "Advanced Runic Power",
                "entries": [
                  "Starting at 7th level, you’ve begun to delve more into your runic arts, learning more and more of the ancient ways. Choose one of the following runes to learn:",
                  {
                    "type": "options",
                    "entries": [
                      {
                        "type": "entries",
                        "name": "Rune of Recovery",
                        "entries": [
                          "You’ve etched a tattoo of old magicks capable of mending wounds. As an action you touch a creature, they regain 1d10 + your Charisma modifier hit points and are cured from one disease or poison afflicting them. You have two uses of this rune, regaining all spent uses after a short or long rest.",
                          "As an action, you can invoke a more latent power of the rune, granting you a boon of health. Your Constitution score is increased by 2, to a maximum of 22. While the rune is invoked, you are immune to poison and disease and you restore 1 hit point at the start of each of your turns. This boon lasts for 1 hour, after which you cannot invoke the power of this rune again for 7 days."
                        ]
                      },
                      {
                        "type": "entries",
                        "name": "Rune of Blustering Winds",
                        "entries": [
                          "A magic tattoo appears on your back, resembling runes in the shape of dragon-like wings. Whenever you take the dash action, you do not provoke opportunity attacks and you ignore the effects of difficult terrain. As a reaction, whenever a ranged weapon attack would hit you, you can impose disadvantage on that attack, potentially causing it to miss as you summon forth a powerful gale from the palm of your hands.",
                          "As an action, you can invoke a more latent power of the rune, granting you a boon of immense speed enough to lift you off your feet. Your Dexterity score is increased by 2, to a maximum of 22. While the rune is invoked, you have a flying speed of 30 ft and you can hover. If you already have a flying speed, it is increased by 30 ft. This boon lasts for 1 hour, after which you cannot invoke the power of this rune again for 7 days."
                        ]
                      },
                      {
                        "type": "entries",
                        "name": "Rune of Foresight",
                        "entries": [
                          "A rune appears over your forehead, representing a third eye, as a bonus action you can take a defensive stance on your turn so long as you have not moved more than half of your movement speed. While in this defensive stance, you reduce any incoming damage by half as you pivot away from the full force of it. This has no effect on spells or magical effects that fully envelops your space, nor does it reduce psychic damage.",
                          "As an action, you can invoke a more latent power of the rune, granting you a boon of true foresight. Your Wisdom score is increased by 2, to a maximum of 22. While the rune is invoked, you have advantage on Wisdom (Insight) checks and as a reaction if you were to be hit by a weapon attack, you can instead choose to avoid the attack entirely. This boon lasts for 1 hour, after which you cannot invoke the power of this rune again for 7 days."
                        ]
                      }
                    ]
                  }
                ]
              }
            ],
            [
              {
                "name": "Runic Warrior",
                "entries": [
                  "Starting at 10th level, your attunement to your runes has given you an unnatural resistance against magical effects. You have advantage on saving throws against spells and other magical effects. In addition, spell attacks have disadvantage against you if you are within 15 ft of the caster."
                ]
              }
            ],
            [
              {
                "name": "Runic Replenishment",
                "entries": [
                  "At 14th level by spending half of your hit dice during a short rest, you can replenish the usage of invoking latent power for one of your runes. Once you do so, you cannot do so again for that rune for 7 days."
                ]
              }
            ],
            [
              {
                "name": "Additional Runes",
                "entries": [
                  "At 18th level, choose any two rune options from 3rd or 7th level. Both runes do not have to be from the same list of runes."
                ]
              }
            ],
            [
              {
                "name": "Runic Mastery",
                "entries": [
                  "At 20th level, after a long rest you can replenish the usage of invoking one of your runes latent power. In addition, the maximum ability score the latent power of your runes can increase becomes 24 instead of 22."
                ]
              }
            ]
          ],
          "source": "DW",
          "shortName": "Runic Scribe"
        }
      ],
      "fluff": [
        {
          "entries": [
            "A Dragon Warrior is a powerful fighter who has either made a deal with a dragon, has been blessed by a dragon, has killed a dragon or was around when a dragon died and absorbed its power, or was raised by a dragon. Either way, a Dragon Warrior uses the magical power that originated from a dragon, but has evolved it into their own power. While Dragons are indeed magical they are very limited on the spell casting end of things, which is what the Dragon Warrior tries to make up for with physical combat. One of the many benefits of the Dragon Warrior is that they have a lot of options, there are a lot of options that the Dragon Warrior can have and many that they will never obtain. There is a lot of versatility and choices for each Dragon Warrior, making 1 entirely different from the others. If you like a class with a lot of options, then this may be one for you."
          ],
          "name": "Dragon Warrior",
          "type": "section"
        }
      ]
    }
  ]
}