{
    "_meta": {
        "sources": [
            {
                "json": "DM",
                "abbreviation": "DM",
                "full": "Dragon Mage",
                "authors": [
                    "Erikku Blade"
                ],
                "convertedBy": [
                    "CrimtaneCreeper"
                ],
                "version": "2.0",
                "url": "https://docs.google.com/document/d/1gg_4wnR21KBbeJvadNxKl2ehRrCwRldmPI8EV7Uj6Wo/edit?usp=sharing",
                "targetSchema": "1.0.0"
            }
        ]
    },
    "class": [
        {
            "name": "Dragon Mage",
            "source": "DM",
            "hd": {
                "number": 1,
                "faces": 8
            },
            "proficiency": [
                "int",
                "cha"
            ],
            "classTableGroups": [
                {
                    "colLabels": [
                        "Draconian Powers",
                        "Cantrips"
                    ],
                    "rows": [
                        [
                            0,
                            3
                        ],
                        [
                            3,
                            3
                        ],
                        [
                            3,
                            3
                        ],
                        [
                            4,
                            4
                        ],
                        [
                            4,
                            4
                        ],
                        [
                            5,
                            4
                        ],
                        [
                            5,
                            4
                        ],
                        [
                            6,
                            4
                        ],
                        [
                            6,
                            5
                        ],
                        [
                            7,
                            5
                        ],
                        [
                            7,
                            5
                        ],
                        [
                            8,
                            5
                        ],
                        [
                            8,
                            5
                        ],
                        [
                            9,
                            6
                        ],
                        [
                            9,
                            6
                        ],
                        [
                            10,
                            6
                        ],
                        [
                            10,
                            6
                        ],
                        [
                            11,
                            6
                        ],
                        [
                            11,
                            6
                        ],
                        [
                            12,
                            6
                        ]
                    ]
                },
                {
                    "title": "Spell Slots per Spell Level",
                    "colLabels": [
                        "{@filter 1st|spells|level=1|class=Dragon Mage (DM)}",
                        "{@filter 2nd|spells|level=2|class=Dragon Mage (DM)}",
                        "{@filter 3rd|spells|level=3|class=Dragon Mage (DM)}",
                        "{@filter 4th|spells|level=4|class=Dragon Mage (DM)",
                        "{@filter 5th|spells|level=5|class=Dragon Mage (DM)}",
                        "{@filter 6th|spells|level=6|class=Dragon Mage (DM)}",
                        "{@filter 7th|spells|level=7|class=Dragon Mage (DM)}",
                        "{@filter 8th|spells|level=8|class=Dragon Mage (DM)}",
                        "{@filter 9th|spells|level=9|class=Dragon Mage (DM)}"
                    ],
                    "rows": [
                        [
                            2,
                            "-",
                            "-",
                            "-",
                            "-",
                            "-",
                            "-",
                            "-",
                            "-"
                        ],
                        [
                            3,
                            "-",
                            "-",
                            "-",
                            "-",
                            "-",
                            "-",
                            "-",
                            "-"
                        ],
                        [
                            4,
                            2,
                            "-",
                            "-",
                            "-",
                            "-",
                            "-",
                            "-",
                            "-"
                        ],
                        [
                            4,
                            3,
                            "-",
                            "-",
                            "-",
                            "-",
                            "-",
                            "-",
                            "-"
                        ],
                        [
                            4,
                            3,
                            2,
                            "-",
                            "-",
                            "-",
                            "-",
                            "-",
                            "-"
                        ],
                        [
                            4,
                            3,
                            3,
                            "-",
                            "-",
                            "-",
                            "-",
                            "-",
                            "-"
                        ],
                        [
                            4,
                            3,
                            3,
                            1,
                            "-",
                            "-",
                            "-",
                            "-",
                            "-"
                        ],
                        [
                            4,
                            3,
                            3,
                            2,
                            "-",
                            "-",
                            "-",
                            "-",
                            "-"
                        ],
                        [
                            4,
                            3,
                            3,
                            3,
                            1,
                            "-",
                            "-",
                            "-",
                            "-"
                        ],
                        [
                            4,
                            3,
                            3,
                            3,
                            2,
                            "-",
                            "-",
                            "-",
                            "-"
                        ],
                        [
                            4,
                            3,
                            3,
                            3,
                            2,
                            1,
                            "-",
                            "-",
                            "-"
                        ],
                        [
                            4,
                            3,
                            3,
                            3,
                            2,
                            1,
                            "-",
                            "-",
                            "-"
                        ],
                        [
                            4,
                            3,
                            3,
                            3,
                            2,
                            1,
                            1,
                            "-",
                            "-"
                        ],
                        [
                            4,
                            3,
                            3,
                            3,
                            2,
                            1,
                            1,
                            "-",
                            "-"
                        ],
                        [
                            4,
                            3,
                            3,
                            3,
                            2,
                            1,
                            1,
                            1,
                            "-"
                        ],
                        [
                            4,
                            3,
                            3,
                            3,
                            2,
                            1,
                            1,
                            1,
                            "-"
                        ],
                        [
                            4,
                            3,
                            3,
                            3,
                            2,
                            1,
                            1,
                            1,
                            1
                        ],
                        [
                            4,
                            3,
                            3,
                            3,
                            3,
                            1,
                            1,
                            1,
                            1
                        ],
                        [
                            4,
                            3,
                            3,
                            3,
                            3,
                            2,
                            1,
                            1,
                            1
                        ],
                        [
                            4,
                            3,
                            3,
                            3,
                            3,
                            2,
                            2,
                            1,
                            1
                        ]
                    ]
                }
            ],
            "startingProficiencies": {
                "armor": [],
                "weapons": [
                    "daggers",
                    "darts",
                    "slings",
                    "quarterstaffs"
                ],
                "tools": [
                    "Choose one set of Artisans Tools"
                ],
                "skills": [
                    {
                        "choose": {
                            "from": [
                                "arcana",
                                "deception",
                                "history",
                                "insight",
                                "medicine",
                                "nature",
                                "persuasion",
                                "religion"
                            ],
                            "count": 2
                        }
                    }
                ]
            },
            "startingEquipment": {
                "additionalFromBackground": true,
                "default": [
                    "(a) a set of Artisans Tools",
                    "(a) arcane focus or (b) component pouch",
                    "(a) Explorer's Pack or (b) Scholar's Pack",
                    "(a) 2 daggers or (b) sling and a bag of ammunition",
                ],
                "goldAlternative": "5d4x10"
            },
            "multiclassing": {
                "requirements": {
                    "cha OR int": 13
                },
                "proficienciesGained": {
                    "tools": [
                        "Divination Deck"
                    ]
                }
            },
            "classFeatures": [
                [
                    {
                        "name": "Divination Deck",
                        "entries": [
                            "A divination deck consists of 24 blank cards. A divination deck can be used during times of respite. (Outside of combat; during a short or long rest. This action counts as light activity.) Using a divination deck you perform a 10 minute ritual and call upon the voices of fate to guide you. When using a Divination Deck, ask a question. You can predict very vague messages through the divination deck, these messages can be forewarnings of upcoming events. These messages can be as vague as the DM desires. After the question is asked, roll the Divination Deck tool using Charisma. A roll of 9 or lower automatically fails, and the card you draw is blank. A roll of 10 or higher the roll is successful and you receive a vague answer to the question. The message appears on the blank card in a language of your choosing that you can read. The message can only be 50 words or less. The message remains visible on the card for up to 10 minutes, or until you dispel it. If you want a more specific answer to the question, ask the question again and roll once more. The DC is determined by the DM, however some questions cannot be answered by the deck, DM’s discretion.",
                            "A divination deck is usually pawned off as a cheap toy in shops, being worth only 1 sp. Most shopkeepers will not purchase one from a player as it is of little interest. Finding one should not be difficult however."
                        ]
                    },
                    {
                        "name": "Spellcasting",
                        "entries": [
                            "Drawing on the ancient powers of dragons, you can cast spells to shape that essence to your will and express your prowess with the arcane over all others. See chapter 10 of the Player’s Handbook for the general rules of spellcasting",
                            {
                                "type": "entries",
                                "name": "Cantrips",
                                "entries": [
                                    "At 1st level, you know three cantrips of your choice from your available spell lists based on your Draconian Origin. You learn additional Dragon Mage cantrips of your choice at higher levels, as shown in the Cantrips Known column of the Dragon Mage table."
                                ]
                            },
                            {
                                "type": "entries",
                                "name": "Preparing and Casting Spells",
                                "entries": [
                                    "The Dragon Mage table shows how many spell slots you have to cast your spells of 1st level and higher. To cast one of these Dragon Mage spells, you must expend a slot of the spell's level or higher. You regain all expended spell slots when you finish a long rest.",
                                    "You prepare the list of Dragon Mage spells that are available for you to cast, choosing from the Dragon Mage spell list. When you do so, choose a number of Dragon Mage spells equal to your Spell Casting Ability modifier + your Dragon Mage level (minimum of one spell). The spells must be of a level for which you have spell slots.",
                                    "For example, if you are a 3rd-level Dragon Mage, you have four 1st-level and two 2nd-level spell slots. With a Spellcasting Ability of 16, your list of prepared spells can include six spells of 1st or 2nd level, in any combination. If you prepare the 1st-level spell Burning Hands, you can cast it using a 1st-level or 2nd-level slot. Casting the spell doesn't remove it from your list of prepared spells."
                                ]
                            },
                            {
                                "type": "entries",
                                "name": "Spellcasting Ability",
                                "entries": [
                                    "Charisma OR Intelligence is your spellcasting ability for your Dragon Mage spells. The power of your spells comes from your innate ability to bend the weave, granted to you by the Goddess of Magic at birth. You use your Charisma whenever a Dragon Mage spell refers to your spellcasting ability. In addition, you use your Charisma modifier when setting the saving throw DC for a Dragon Mage spell you cast and when making an attack roll with one.",
                                    {
                                        "type": "abilityDc",
                                        "name": "Spell",
                                        "attributes": [
                                            "cha",
                                            "int"
                                        ]
                                    },
                                    {
                                        "type": "abilityAttackMod",
                                        "name": "Spell",
                                        "attributes": [
                                            "cha",
                                            "int"
                                        ]
                                    }
                                ]
                            },
                            {
                                "type": "entries",
                                "name": "Ritual Casting",
                                "entries": [
                                    "You can cast a Dragon Mage spell as a ritual if that spell has the ritual tag and you have the spell prepared."
                                ]
                            },
                            {
                                "type": "entries",
                                "name": "Spellcasting Focus",
                                "entries": [
                                    "You can use an arcane focus or a component as a spellcasting focus for your Dragon Mage spells."
                                ]
                            }
                        ]
                    },
                    {
                        "name": "Draconian Origins",
                        "entries": [
                            "Beginning at 1st Level you choose one chromatic or metallic dragon; this color dragon will be where your power comes from. You gain features depending on this color. In addition you gain a Spellcasting List depending on the color chosen. You are also able to speak, read, and write Draconic. Some of your Draconian Abilities will require a saving throw, the DC for that will equal your Spell Save DC.",
                            "Red: You have resistance to fire damage, at 10th level this becomes immunity. Whenever you cast a spell of 1st level or higher that deals fire damage, each creature that suffers the effects of the spell must make a Constitution Saving Throw. On a failed save, the creature will be wreathed in flames that will deal fire damage equal to your spellcasting ability modifier at the start of each of their turns for 1 minute. They can repeat their saving throws at the end of each of their turns, ending the effect on a success. A creature can spend their action putting out the flames, ending the effect early.",
                            "Blue: You have resistance to lightning damage, at 10th level this becomes immunity. Whenever you cast a spell of 1st level or higher that deals lightning damage, you gain an additional 10 ft. to your movement speed and your movement does not provoke attacks of opportunity each of these effects ending at the end of your turn. Additionally each creature that suffers the effects of the spell must make a Constitution Saving Throw or be stunned until the end of your next turn.",
                            "Green: You have resistance to poison damage, at 10th level this becomes immunity. Whenever you cast a spell of 1st level or higher that would deal poison damage, each creature that suffers the effects of the spell must make a Constitution Saving Throw. On a failed save, the creature is poisoned for 1 minute. While poisoned in this way, the creature suffers a -2 to AC and a -10 ft. to its movement speed.",
                            "Black: You have resistance to acid damage, at 10th level this becomes immunity. Whenever you cast a spell of 1st level or higher that would deal acid damage, each creature that suffers the effects of the spell must make a Dexterity Saving Throw. On a failed save you can choose either any non-magical armor or a non-magical weapon they are carrying, roll a d100 to determine what happens to said selected item. The higher stages inherit the lower stages’ effects.",
                            "1-10 : The item is damaged, the next time they crit fail to attack or a critical hit is imposed onto them  the item will break. 11-20 : The item receives a -2 penalty to either AC or to Attack Rolls. 21-30 : The item becomes unwieldy, giving them disadvantage on ability checks while holding the weapon or wearing the armor. 31-40 : The target has disadvantage on attack rolls while wielding the weapon, or disadvantage on saving throws while wearing the armor. 41-50 : While the item is equipped they suffer a -2 penalty to damage rolls. 51-60 : While the item is equipped they have disadvantage on Constitution Saving Throws. 61-70 : While the item is equipped they take 1d6 acid damage at the start of their turns. 71-80 : In 1 minute, the item will be destroyed as it melts away by the acid. 81-90 : In 30 seconds, the item will snap in two, becoming either an improvised weapon, or unusable armor. 91-100 : The item is instantly destroyed and they take 4d6 acid damage.",
                            "White: You have resistance to cold damage, at 10th level it becomes immunity. Whenever you cast a spell of 1st level or higher that deals cold damage, you gain 10 temporary hit points until the start of your next turn. Each creature that suffers the effects of the spell must make a Dexterity Saving Throw, on a failed save they are coated with ice, making their movement speed 0 and their attack rolls are made at a disadvantage until the start of your next turn. If they were in mid flight and failed the save, they fall to the ground and take fall damage as per normal.",
                            "Copper: You have resistance to acid damage, at 10th level it becomes immunity. Whenever you cast a spell of 1st level or higher that deals acid damage, the ground beneath you in a 15 ft radius becomes difficult terrain. While a creature other than yourself moves within this terrain they take 1d6 acid damage for every 5ft they move.",
                            "Bronze: You have resistance to lightning damage, at 10th level it becomes immunity. Whenever you cast a spell of 1st level or higher that deals lightning damage, a burst of electricity blasts out from your hands in a 15 ft radius sphere. Each creature within the sphere, excluding yourself, takes 1d6 lightning damage and must make a Strength Saving Throw. On a failed save they are pushed back 15 ft.",
                            "Brass: You have resistance to fire damage, at 10th level it becomes immunity. Whenever you cast a spell of 1st level or higher that deals fire damage, red gas exudes from your hands in a 15 ft radius sphere. Each creature, excluding yourself within the gas takes 1d6 fire damage and must pass a Constitution Saving throw, falling unconscious on a failed save. The creature(s) reawaken if they take any damage, or if another creature spends their action to wake them.",
                            "Silver: You have resistance to cold damage, at 10th level it becomes immunity. Whenever you cast a spell of 1st level or higher that deals cold damage, icy cold winds blow outward from your body in a 15 ft radius. Each creature within range takes 1d6 cold damage and must make a Constitution Saving Throw, suffering a -2 penalty to their AC and disadvantage on dexterity checks and saving throws on a failed save until the end of your next turn.",
                            "Gold: You have resistance to fire damage, at 10th level it becomes immunity. Whenever you cast a spell of 1st level or higher that deals fire damage, fire flares out in a 15 ft radius sphere. Each creature takes 1d6 fire damage and must make a Strength Saving Throw, suffering disadvantage on all Strength Checks, Saving Throws, and attacks using Strength until the start of your next turn."
                        ]
                    },
                    {
                    	"name": "Draconian Scales",
                    	"entries": [
                    		"Being a Dragon Mage, your body is riddled with dragon scales, making your skin tougher. At 1st level While not wearing armor you have a natural armor equal to 13 + your Dexterity Modifier."
                    	],
                    }
                    {
                        "name": "Draconian Archetype Feature",
                        "entries": [
                            "At 1st level, you gain a feature from your chosen Draconian Archetype"
                        ],
                        "gainSubclassFeature": true
                    }
                ],
                [
                    {
                        "name": "Draconian Powers",
                        "entries": [
                            "Starting at 2nd level you learn the ancient secrets of dragons. You know how they can fly, shoot fire - lighting - acid - even frost out of their mouths. You start off with 3 Draconian Powers and gain more as shown in the Dragon Mage table. Some Draconian Powers are locked away by prerequisites that must be met before they obtain any of these sacred powers such as level and Draconian Origins. You can exchange a Draconian Power for others every time you level up."
                        ]
                    },
                  
                [
                    {
                        "name": "Draconian Awakening",
                        "entries": [
                            "Starting at 3rd level, as an action you can awaken ancient powers from within, maximizing your magical prowess. Once your Draconian Awakening ends, you suffer 1 level of exhaustion and cannot cast spells for 1 round. You cannot use this transformation until you finish a long rest. You gain more uses of this feature per long rest at 7th, 13th, and 17th levels. When you transform, you gain the following benefits for 1 minute :",
                            "You gain advantage on Saving Throws against spells and other magical effects, including a Dragon’s Breath Weapon.",
                            "If you have a flying speed, it increases by 30 ft. If you do not have a flying speed, you gain a flying speed of 40 ft. Until you reach 5th level, you cannot end your turn airborne, any attempt to do so causes you to fall.",
                            "You reduce the amount of damage you take from spells and other magical effects by 1d10. You can only do so once per round.",
                            "You increase the amount of damage dealt by your spells and other magical effects by 1d10. You can only do so once per round."
                        ]
                    }
                ],
                [
                    {
                        "name": "Ability Score Improvement",
                        "entries": [
                            "When you reach 4th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
                            "If your DM allows the use of feats, you may instead take a feat."
                        ]
                    }
                ],
                [
                    {
                        "name": "Draconian Recovery",
                        "entries": [
                            "At 5th level, you have learned to regain some of your magical energy by pulling power out from the depths of your draconian soul. Once per day when you finish a short rest, you can choose expended spell slots to recover. The spell slots can have a combined level that is equal to or less than half your Dragon Mage level (rounded up), and none of the slots can be 6th level or higher.",
                            "For example, if you're a 5th-level Dragon Mage, you can recover up to two levels worth of spell slots. You can recover either a 2nd-level spell slot or two 1st-level spell slots."
                        ]
                    }
                ],
                [
                    {
                        "name": "Draconian Archetype Feature",
                        "entries": [
                            "At 6th level, you gain a feature from your chosen Draconian Archetype"
                        ],
                        "gainSubclassFeature": true
                    }
               ],
               [
                    {
                        "name": "Ability Score Improvement",
                        "entries": [
                            "When you reach 8th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
                            "If your DM allows the use of feats, you may instead take a feat."
                        ]
                    }
                ],
                [
                    {
                        "name": "Spell Expertise",
                        "entries": [
                            "Starting at 9th level, you have become exceptionally skilled at learning spells. You can choose an additional spell list provided by the Draconian Spellcasting Lists. Starting at 14th level, you can choose an additional list to choose spells from."
                        ]
                    }
                ],
                [
                    {
                        "name": "Draconian Resistance",
                        "entries": [
                            "Starting at 10th level, whenever you fail a saving throw against a spell or magical effect, as a reaction you can roll an additional time, choosing the highest result. Once you use this feature you cannot do so again until you finish a long rest. At 15th level, instead of rolling you can choose to succeed instead."
                        ]
                    }
                ],
                [
                    {
                        "name": "Draconian Archetype Feature",
                        "entries": [
                            "At 11th level, your gain a feature from your chosen Draconian Archetype"
                        ],
                        "gainSubclassFeature": true
                    }
                ],
                [
                    {
                        "name": "Ability Score Improvement",
                        "entries": [
                            "When you reach 12th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
                            "If your DM allows the use of feats, you may instead take a feat."
                        ]
                    }
                ],
                [
                    {
                        "name": "Draconian Archetype Feature",
                        "entries": [
                            "At 16th level, your gain a feature from your chosen Draconian Archetype"
                        ],
                        "gainSubclassFeature": true
                    }
                ],
                [
                    {
                        "name": "Ability Score Improvement",
                        "entries": [
                            "When you reach 16th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
                            "If your DM allows the use of feats, you may instead take a feat."
                        ]
                    }
                ],
                [
                    {
                        "name": "Draconian Mastery",
                        "entries": [
                            "Starting at 18th level, At 18th level, you have achieved such mastery over certain spells that you can cast them at will. Choose a 1st-level Dragon Mage spell and a 2nd-level Dragon Mage spell. You can cast those spells at their lowest level without expending a spell slot when you have them prepared. If you want to cast either spell at a higher level, you must expend a spell slot as normal."
                        ]
                    }
                ],
                [
                    {
                        "name": "Ability Score Improvement",
                        "entries": [
                            "When you reach 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
                            "If your DM allows the use of feats, you may instead take a feat."
                        ]
                    }
                ],
                [
                    {
                        "name": "Draconian Archetype Feature",
                        "entries": [
                            "At 20th level, your gain a feature from your chosen Draconian Archetype"
                        ],
                        "gainSubclassFeature": true
                    }
                ]
            ],
            "subclassTitle": "Draconian Archetype",
            "subclasses": [
                {
                    "name": "Devoted",
                    "entries": [
                        "The Devoted Dragon Mages are those who study or even worship the mighty Dragon Gods such as Bahamut and Tiamat. Depending on the Dragon God you choose to worship or study varies the abilities you can obtain."
                    ],
                    "subclassFeatures": [
                        [
                            {
                                "name": "Devoted Spellcasting",
                                "entries": [
                                    "At 1st level you obtain an expanded spell list depending on the Dragon God you choose to worship or study. These spells are added to your Dragon Mage Spell Lists and count as Dragon Mage spells when you cast them.",
                                    {
                                        "type": "table",
                                        "caption": "Bahmut",
                                        "colLabels": [
                                            "Spell Level",
                                            "Spells"
                                        ],
                                        "rows": [
                                            [
                                                "1st",
                                                "Bless, Cure Wounds, Healing Word, Sanctuary, Shield of Faith"
                                            ],
                                            [
                                                "2nd",
                                                "Aid, Augury, Calm Emotions, Prayer of Healing, Lesser Restoration"
                                            ],
                                            [
                                                "3rd",
                                                "Beacon of Hope, Daylight, Mass Healing Word, Revivify, Spirit Guardians"
                                            ],
                                            [
                                                "4th",
                                                "Banishment, Death Ward, Divination, Guardian of Faith"
                                            ],
                                            [
                                                "5th",
                                                "Commune, Greater Restoration, Mass Cure Wounds"
                                            ],
                                            [
                                            	"6th",
                                            	"Heal"
                                            ],
                                            [
                                            	"7th",
                                            	"Conjure Celestial"
                                            ],
                                            [
                                            	"8th",
                                            	"Holy Aura"
                                            ],
                                            [
                                            	"9th",
                                            	"Mass Heal"
                                            ]
                                        ]
                                    },
                                	{
                                        "type": "table",
                                        "caption": "Tiamat",
                                        "colLabels": [
                                            "Dragon Mage Level",
                                            "Spells"
                                        ],
                                        "rows": [
                                            [
                                                "1st",
                                                "Bless, Heroism"
                                            ],
                                            [
                                                "3rd",
                                                "Aid, Branding Smite"
                                            ],
                                            [
                                                "5th",
                                                "Blinding Smite, Daylight"
                                            ],
                                            [
                                                "7th",
                                                "Aura of Life, Aura of Purity"
                                            ],
                                            [
                                                "9th",
                                                "Dawn, Holy Weapon"
                                            ]
                                        ]
                                    }
                           },
                           {
                                "name": "Divine Empowerment",
                                "entries": [
                                    "Also at 1st level, choose Bahamut or Tiamat, you gain one of the following abilities that correlates to what you picked. You can use each of these empowerments once per short rest. You gain another Empowerment at 6th level, another at 11th level, and finally one more at 16th level.",
                                    "Bahamut Divine Blessing : If you were to fail a saving throw, as a reaction you can add 2d4 to the roll.",
                                    "Tiamat Divine Bane : If a creature were to succeed on a saving throw against one of your Dragon Mage spells, as a reaction you can subtract 2d4 from their roll."
                                ]
                            }
                        ],
                        [
                            {
                                "name": "Divine Empowerment",
                                "entries": [
                                    "Starting at 6th level, you can choose one of the following Divine Empowerments",
                                    "[Bhamut] Divine Healing: Whenever you heal a creature(s) with a Dragon Mage spell, as a reaction you can add an additional 2d4 to the roll.",
                                    "[Tiamat] Divine Harming: Whenever you would damage a creature(s) with a Dragon Mage spell, as a reaction you can add an additional 2d4 damage to the roll."
                                ]
                            }
                        ],
                        [
                            {
                                "name": "Divine Empowerment",
                                "entries": [
                                    "Starting at 11th level, you can choose one of the following Divine Empowerments",
                                    "[Bahamut] Divine Grace : When you would be hit by an attack you can, as a reaction you can add 2 to your armor class for that attack - potentially allowing the outcome to change.",
                                    "[Tiamat] Divine Peril: When you would miss an attack roll against a creature, as a reaction you can subtract 2 from their armor class for that attack - potentially allowing the outcome to change."
                                ]
                            }
                        ],
                        [
                            {
                                "name": "Divine Empowerment",
                                "entries": [
                                    "Starting at 16th level, you can choose one of the following Divine Empowerments",
                                    "[Bahamut] Divine Protection : Whenever you would take damage, as a reaction you can subtract 2d4 from the damage roll."
                                ]
                            }
                        ],
                        [
                            {
                                "name": "Divine Calling",
                                "entries": [
                                    "At 20th level, as an action you can call upon the powers of either Tiamat or Bahamut, upon doing so gives you one of the following benefits depending on whom you call upon for 1 minute. Once the effects end you cannot call upon the powers until after you finish a long rest.",
                                    "[Bahamut] Aura of Blessing: You and each friendly creature within 30 ft of you gain a +2 to AC and Saving Throws, your healing spells heal an additional 2d6, you and each friendly creature within 30 ft of you receives 2d6 less damage from any incoming damage once per round, you and each friendly creature within 30 ft of you do not suffer the effects of difficult terrain.",
                                    "[Tiamat] Aura of Destruction: Every hostile creature within 30 ft of you suffer a -2 to their AC and Saving Throws, every hostile creature within 30 ft of you receives 2d6 less hit points from healing spells, every hostile creature within 30 ft of you receives 2d6 more damage from your attacks and spells, every hostile creature within 30 ft of you suffers the effects of difficult terrain."
                                ]
                            }
                        ]
                    ],
                    "source": "DM",
                    "shortName": "Devoted"
                },
                {
                    "name": "Evoker",
                    "entries": [
                        "The Evoker is a spellcaster that focuses on harnessing the energy inside of them and dispersing it, creating devastating attacks and making you and your allies stronger. However, their magic becomes wildly unstable and harder to control."
                    ],
                    "subclassFeatures": [
                        [
                            {
                                "name": "Destructive Magic",
                                "entries": [
                                    "At 1st level, when you cast a Dragon Mage spell that deals damage it gains a bonus to the damage roll equal to your spellcasting ability modifier."
                                ]
                            }
                       ],
                       [
                            {
                                "name": "Evoke Energy",
                                "entries": [
                                    "Also at 1st level you have a pool of energy that you’ll use for your Evoker Features called Evoke Energy. You have an amount of Evoke Energy equal to twice your Dragon Mage level. You regain all expended Evoke Energy after a long rest. As a bonus action on your turn you can spend your Evoke Energy to do one of the following effects :",
                                    "Evoke Destruction : When you cast an evocation spell of 1st level or higher that deals damage, by spending 2 Evoke Energy you can double the range of that spell and deal an additional amount of damage equal to 2 times the spell’s level. As a result, you suffer an amount of damage equal to the bonus damage dealt. You do not gain the benefits of any resistances or immunities to this damage.",
                                    "Evoke Speed : When you cast an evocation spell of 1st level or higher you can spend 2 Evoke Energy to cause you and all your allies within 30 ft of you to gain 10 ft of movement speed.",
                                    "Evoke Durability : When you cast an evocation spell of 1st level or higher you can spend 2 Evoke Energy to grant your allies within 30 ft of you also gain 10 temporary hit points, you yourself however do not receive that bonus.",
                                    "Evoke Strength : When you cast an evocation spell of 1st level or higher, by spending 2 Evoke Energy to have allies within 30 ft of you gain advantage on all attack rolls and saving throws, you yourself however do not receive that bonus."
                                ]
                            }
                        ],
                        [
                            {
                                "name": "Evoke Aura",
                                "entries": [
                                    "Beginning at 6th level you can spend an action and 2 Evoke Energy to activate your “Evoke Aura”. Your Aura does not have a duration, however at the start of each of your turns you must spend 2 Evoke Energy to prolong the aura. While the Aura is active you have the following effects :",
                                    "Each creature you choose within 30ft of you makes a Wisdom saving throw against your spell save DC, on a failed save they are frightened for as long as the aura lasts, on a success they are immune to this effect for 24 hours. Each affected creature can repeat their save at the end of each of their turns, ending this effect on a success.",
                                    "Creatures who are frightened of you have disadvantage on ability checks and saving throws against Evocation spells you cast. In addition, creatures frightened of you cannot regain hit points if they are within your Aura’s radius.",
                                    "You can choose a number of creatures within your aura’s radius up to your spellcasting ability modifier, those creatures gain a number of temporary hit points equal to half your Dragon Mage level at the start of each of their turns.",
                                    "When the effects of your Evoke Aura ends you suffer 1 level of exhaustion and take 2d12 necrotic damage. Once you have used your Evoke Aura once, you cannot do so again until you finish a long rest."
                                ]
                            }
                        ],
                        [
                            {
                                "name": "Evoke Full Release",
                                "entries": [
                                    "At 11th level, as an action you can spend all of your remaining Evoke Energy to release a burst of energy outward 60 ft in every direction. This Energy will heal your allies within range 1d6 per Evoke Energy spent and deal 1d6 force damage per Evoke Energy spent to each hostile creature within range. When doing so, you take 2d6 damage per Evoke Energy spent. When you use this feature you cannot do so again until you finish a long rest. The damage you take ignores all damage reductions, immunities, and resistances. If you were to die as a result of this attack, your body and soul are destroyed. Only the means of the Wish spell can return you to life."
                                ]
                            }
                        ],
                        [
                            {
                                "name": "Evoke Control",
                                "entries": [
                                    "At 16th level, when you spend Evoke Energy on an evocation spell that deals damage, you can spend twice the amount you would normally spend to deal no damage to objects and allies within the range of the spell. Once you use this feature you cannot do so again until you finish a short rest."
                                ]
                            }
                        ],
                        [
                            {
                                "name": "Evoke Mastery",
                                "entries": [
                                    "At 20th level, you have learned how to harness your Evoke Energy more efficiently, being able to call upon it more reliably. Whenever you roll initiative while you have no Evoke Energy, you regain 8. In addition, all of your Evoke Energy now restores after a short rest."
                                ]
                            }
                        ]                        
                    ],

                    "source": "DM",
                    "shortName": "Evoker"
                },
                {
                    "name": "Primordial",
                    "entries": [
                        "Fire, Water, Earth, Wind, these are the four main elementals that bring everything in perfect balance. Dragons have been able to control these elements, but only the Primordial Dragons could truly master these elements, and now you can too."
                    ],
                    "subclassFeatures": [
                        [
                            {
                                "name": "Elemental Attunement",
                                "entries": [
                                    "Beginning at 1st level, you gain the Druidcraft cantrip and one additional cantrip depending on your Draconian Origin damage type. You also learn how to speak, read, and write all dialects of Primordial. The damage provided by your Draconian Origin becomes known as your “Primordial Damage”. Cantrips with a '*' are custom cantrips (see below)",
                                    "Fire : Control Flames",
                                    "Cold : Shape Water",
                                    "Lightning : Control Sparks*",
                                    "Acid : Shape Acid*",
                                    "Poison : Poison Flow*",
                                    "These cantrips do not count against your total known cantrips and count as Dragon Mage cantrips."
                                ]
                            },
                            {
                                "name": "Elemental Supremacy",
                                "entries": [
                                    "Starting at 6th level, when you cast a spell of 1st level or higher that deals your Primordial Damage, you can instead deal the maximum amount of damage for the spell instead of rolling damage. You can use this feature a number of times equal to half your proficiency bonus rounded down. You regain all expended uses of this feature after you finish a short rest."
                                ]
                            },
                            {
                                "name": "Primordial Summons",
                                "entries": [
                                    "Starting at 11th level, depending on your Primordial Damage, you gain the ability to use the “Conjure Elementals” spell to summon that specific Elemental without requiring concentration on the spell or spending a spell slot. The Elemental lasts for the spell's normal duration and follows your commands as per the spell. The Elementals adopt the appearance of Dragons, but retain the original creature size.",
                                    "Fire : Fire Elemental",
                                    "Cold : Ice Elemental (Uses Earth Elemental stats but deals cold damage instead and the Earth Glide glides through solid ice rather than stone. It also replaces its Immunity to Poison damage with Cold.)",
                                    "Lightning : Storm Elemental (Uses Air Elemental stats but deals lightning damage instead and replaces its immunity to Poison damage with Lightning instead.)",
                                    "Acid : Acid Elemental (Uses stats for a Water Elemental but deals Acid damage instead and replaces its immunity to Poison damage with Acid.)",
                                    "Poison : Poison Elemental (Uses stats for Earth Elemental but deals poison damage instead, but loses its Earth Glide feature.)",
                                    "The Elementals follow the rules of the Conjure Elemental Spell and have advantage on saving throws against spells and other magical effects. Once you use this feature you cannot do so again until you finish a long rest."
                                ]
                            },
                            {
                                "name": "Primordial Transformation",
                                "entries": [
                                    "Starting at 16th level, as an action you can attain the shape of a Primordial. While in this state you gain the features of the Elementals you can summon as well as their slam attacks - which for the purposes of this transformation is the slam attacks are melee spell attacks. You retain your original features and stats, unless your Elemental has higher stats. This transformation lasts for 1 minute. Also depending on your Primordial Damage, you gain one of the following features while transformed in this way :",
                                    "Fire : Flaming Weapons. Your weapons become magical for the purposes of overcoming magic resistances and are wreathed in flames, dealing an additional 2d6 fire damage.",
                                    "Cold : Frozen Body. Your AC increases by 2 and you have advantage on all Constitution Saving Throws and your Slam attacks deal 2d6 cold damage.",
                                    "Lightning : Shocking Retaliation. Whenever you are hit by a melee weapon attack, the source of the attack takes 2d6 lightning damage.",
                                    "Acid : Melting Touch. Whenever you come into contact with an object, make a melee spell attack. On hit you deal 2d6 acid damage and the object begins to melt away. Depending on the size of the object it could take as little as 10 seconds to as long as 1 hour to melt away.",
                                    "Poison : Toxic Touch : When you come into contact with a creature, they must make a Constitution Saving Throw against your Spell Save DC. On a failed save they become poisoned for 1 hour. They can repeat their saving throw at the end of each of their turns.",
                                    "Once your transformation ends, you suffer 1 level of exhaustion and cannot transform again until you finish a long rest."
                                ]
                            }
                        ],
                        [
                            {
                                "name": "Primordial Appearance",
                                "entries": [
                                    "Also at 16th level, rather than unleashing the might of the Primordial Transformation - you can assume the appearance of it at any given time, doing so however does not grant you the benefits of said transformation."
                                ]
                            }
                        ],
                        [
                            {
                                "name": "Primordial Lord",
                                "entries": [
                                    "At 20th level, you have mastered your control over the elements. You can now use your Primordial Transformation indefinitely and can permanently summon your Elemental as a companion, but can only summon one at a time. You also have advantage on Charisma checks with other Elementals, as they view you as a powerful Primordial."
                                ]
                            }
                        ]
                    ],
                    "source": "DM",
                    "shortName": "Primordial"
                }
            ],
            "Fluff": [
                {
                    "entries": [
                        "A divination deck consists of 24 blank cards. A divination deck can be used during times of respite. (Outside of combat; during a short or long rest. This action counts as light activity.) Using a divination deck you perform a 10 minute ritual and call upon the voices of fate to guide you. When using a Divination Deck, ask a question. You can predict very vague messages through the divination deck, these messages can be forewarnings of upcoming events. These messages can be as vague as the DM desires. After the question is asked, roll the Divination Deck tool using Charisma. A roll of 9 or lower automatically fails, and the card you draw is blank. A roll of 10 or higher the roll is successful and you receive a vague answer to the question. The message appears on the blank card in a language of your choosing that you can read. The message can only be 50 words or less. The message remains visible on the card for up to 10 minutes, or until you dispel it. If you want a more specific answer to the question, ask the question again and roll once more. The DC is determined by the DM, however some questions cannot be answered by the deck, DM’s discretion.",
                        "A divination deck is usually pawned off as a cheap toy in shops, being worth only 1 sp. Most shopkeepers will not purchase one from a player as it is of little interest. Finding one should not be difficult however."
                    ],
                    "name": "DragonMage",
                    "type": "section"
                }
            ]
    ]
}