{
	"_meta": {
		"sources": [
			{
				"json": "GodsoftheDawnofWar",
				"abbreviation": "GDW",
				"full": "Gods of the Dawn of War",
				"url": "",
				"authors": [
					"Erikku Blade"
				],
				"convertedBy": []
			}
		],
		"dateAdded": 1592504588,
		"dateLastModified": 1592504588
	},
	"monster": [
		{
			"name": "The Traveling Merchant",
			"source": "GodsoftheDawnofWar",
			"page": 0,
			"size": "M",
			"type": "celestial",
			"alignment": [
				"C",
				"G"
			],
			"ac": [
				{
					"ac": 46,
					"from": [
						"Temporal Shift"
					]
				}
			],
			"hp": {
				"formula": "234d20 + 2340",
				"average": 7020
			},
			"speed": {
				"walk": 300,
				"fly": {
					"number": 1200,
					"condition": "(hover)"
				},
				"canHover": true
			},
			"str": 34,
			"dex": 42,
			"con": 30,
			"int": 42,
			"wis": 40,
			"cha": 50,
			"save": {
				"int": "+30",
				"wis": "+29",
				"con": "+24",
				"cha": "+34",
				"dex": "+30",
				"str": "+26"
			},
			"senses": [
				"truesight 240 ft."
			],
			"passive": 53,
			"languages": [
				"all",
				"telepathy (no range limit)"
			],
			"spellcasting": [
				{
					"name": "Innate Spellcasting",
					"headerEntries": [
						"The Traveling Merchant’s spellcasting ability is Charisma (spell save {@dc 42}, +34 to hit with attack spells). The Traveling Merchant can innately cast the following spells, requiring no components:"
					],
					"constant": [
						"{@spell comprehend languages}",
						"{@spell foresight}",
						"{@spell mind blank}",
						"{@spell nondetection}"
					],
					"ability": "cha",
					"type": "spellcasting"
				},
				{
					"name": "Temporal Spellcasting",
					"headerEntries": [
						"The Traveling Merchant knows all spells available to clerics, sorcerers, warlocks, and wizards and can cast each five times per day at 9th level."
					],
					"type": "spellcasting"
				}
			],
			"trait": [
				{
					"name": "Discorporation",
					"entries": [
						"When The Traveling Merchant drops to 0 hit points or dies, his body is destroyed but his essence travels back to his realm of paradox, and he is unable to take physical form for a time."
					]
				},
				{
					"name": "Legendary Resistance (10/Day)",
					"entries": [
						"If The Traveling Merchant fails a saving throw, she can choose to succeed instead."
					]
				},
				{
					"name": "Magic Weapons",
					"entries": [
						"The Traveling Merchant's weapon attacks are magical."
					]
				},
				{
					"name": "Regeneration",
					"entries": [
						"If The Traveling Merchant has at least 1 hit point, he regains 100 hit points at the start of his turn."
					]
				},
				{
					"name": "Luck of the Timelord",
					"entries": [
						"The Traveling Merchant has advantage on all of his attack rolls and saving throws, and targets have disadvantage on saving throws against his spells and attacks. The Traveling Merchant rolls a critical hit on a roll of 18-20 and he rolls the damage dice three times instead of twice."
					]
				},
				{
					"name": "Timely Fortune",
					"entries": [
						"The Traveling Merchant has 20 luck points he can use at any time (lucky feat, PHB p. 167). He regains these points at dawn."
					]
				},
				{
					"name": "Divine Might",
					"entries": [
						"A greater god's attacks and effects ignore the resistances and immunities of creatures CR 30 and below. A greater god's attacks and effects targeting creatures of CR 31-40 ignore resistances and treat immunities as resistance (condition immunities provide advantage in lieu of immunity)"
					]
				},
				{
					"name": "Epic Magic Immunity",
					"entries": [
						"The Traveling Merchant can't be affected or detected by spells of 12th level or lower unless he wishes to be. He has advantage on saving throws against all other spells and magical effects."
					]
				},
				{
					"name": "Avoidance",
					"entries": [
						"If The Traveling Merchant is subjected to an effect that allows him to make a saving throw to only take half damage, he instead takes no damage if he succeeds on the saving throw, and only half damage if he fails."
					]
				},
				{
					"name": "Beyond Reality",
					"entries": [
						"The Traveling Merchant exists beyond the bounds of the multiverse, allowing him to cast magic normally through his own source of power rather than the bounding restrictions of any god or goddess of magic."
					]
				},
				{
					"name": "Reality Breaker",
					"entries": [
						"The Traveling Merchant has a dagger that can rip through the fabric of reality.",
						"Reality Breaker is a +5 artifact dagger with a range of 600/1200 and when thrown immediately flies back into its wielder's hand.",
						"As an action, The Traveling Merchant can make an attack action as normal, but with one or multiple attacks he rips open rifts into other planes. Each of these rifts operate as per the Gate spell, and can lead to any plane including the domains of Gods.",
						"Each time a creature is hit with this dagger, a piece of their soul is damaged as well. A creature hit with this dagger cannot gain the benefits of any healing until they finish a long rest. In addition, a creature reduced to 0 hit points is instantly killed and their soul is destroyed. They cannot be resurrected by any means short of a {@spell wish} spell, and only if The Traveling Merchant allows it.",
						"A deity or similar being slain by this dagger is destroyed permanently."
					]
				}
			],
			"action": [
				{
					"name": "Multiattack",
					"entries": [
						"The Traveling Merchant uses his Divine Presence and Temporal Shatter if its available, he then makes five attacks."
					]
				},
				{
					"name": "Divine Presence",
					"entries": [
						"Each creature within 120 ft of The Traveling Merchant must make a {@dc 42} Wisdom saving throw. On a failed save, they have disadvantage on attack rolls, ability checks, and saving throws made against The Traveling Merchant and in addition, they cannot gain advantage on attack rolls, ability checks, or saving throws against The Traveling Merchant. These effects end when they stay out of range of this effect for more than 10 minutes. On a successful save, they are immune to this effect for the next hour. If they fail the saving throw by 10 or more, attack rolls that are less than a 20 on the {@dice d20} automatically miss, dealing no damage. Saving throws and ability checks that are less than a 20 on the {@dice d20} automatically fail. A creature can repeat their save at the end of each of their turns."
					]
				},
				{
					"name": "Reality Breaker",
					"entries": [
						"{@atk mw,rw} {@hit 39} to hit, reach 5 ft. or range 600/1200 ft., one target. {@h}22 ({@damage 4d4 + 12}) piercing damage in melee, or 22 ({@damage 4d4 + 12}) piercing damage at range, plus 34 ({@damage 4d10 + 12}) force damage."
					]
				},
				{
					"name": "Temporal Shatter {@recharge 5}",
					"entries": [
						"The Traveling Merchant reaches into the mind of one creature he can see and wanders through their memories. He then alters the events that took place, or even removes them entirely. The target must make a Wisdom saving throw {@dc 42} or take {@damage 24d12} force damage and completely forgets that memory for 24 hours, or permanently. (The Traveling Merchant's choice.) On a success, the target only takes half damage and retains the memory, though it appears fuzzy for 24 hours.",
						"For each memory lost in this way, the creature's level (or CR) is reduced by 1. If their level (or CR) is reduced to 0, they die."
					]
				},
				{
					"name": "Perfect Mimic",
					"entries": [
						"The Traveling Merchant creates any number of perfect illusions of himself in unoccupied spaces he can see that last for 1 hour. He may use a bonus action to exert precise control over the illusions, otherwise they imitate his movements perfectly. He can cast spells or attack as though he were in the illusions place. These illusions appear in the minds of each creature and even fools truesight."
					]
				},
				{
					"name": "Alter Reality {@recharge 5}",
					"entries": [
						"The deity can duplicate any spell of 12th level or lower as an action. The duplicated spell has no material or XP components, and the DC of its saving throw (if one is allowed) is 42. The deity also can duplicate a spell with any metamagic feat (so long as the metamagic feat is available to characters of 20th level or lower). The deity can render a magical or supernatural effect permanent. The deity can undo any magical or supernatural effect. The deity can create temporary, nonmagical objects. This works like the Create Object ability, except that the items last one day per rank. The deity also can create permanent nonmagical objects as if using the Create Object ability. The deity can create temporary magic items or creatures. The deity can reshape a landscape, creating any type of terrain the deity can imagine.",
						"There are also other effects that can take place by the DM's discretion."
					]
				},
				{
					"name": "Replicate Divinity {@recharge}",
					"entries": [
						"The Traveling Merchant can replicate any God or other Divine being's abilities. Their effects and action cost apply as normal, any ability that requires a saving throw has a save DC of 42."
					]
				}
			],
			"legendary": [
				{
					"name": "Attack",
					"entries": [
						"The Traveling Merchant makes a Reality Breaker attack."
					]
				},
				{
					"name": "Teleport",
					"entries": [
						"The Traveling Merchant can teleport to an unoccupied space within half his fly speed."
					]
				},
				{
					"name": "Innate Spellcasting",
					"entries": [
						"The Traveling Merchant casts a spell."
					]
				},
				{
					"name": "Regenerate",
					"entries": [
						"The Traveling Merchant regenerates 150 hit points."
					]
				},
				{
					"name": "Temporal Curse (Costs 2 Actions)",
					"entries": [
						"The Traveling Merchant curses one creature he can see. The creature must make a {@dc 42} Wisdom saving throw, or be shackled by the chains of time.",
						"The creature is {@condition incapacitated}, their movement speed is 0, and they automatically fail saving throws. Attack rolls have advantage and each attack that hits is considered a critical hit.",
						"This effect ends at the end of the creature's next turns. After which, for the next minute the creature's speed is cut in half and they can only make one weapon attack per turn. They also can only take an action or bonus action, not both and lose their reactions."
					]
				},
				{
					"name": "Rewrite (Costs 4 Actions)",
					"entries": [
						"The Traveling Merchant forces one creature he can see to reroll one roll (attack, save, damage, etc.) with disadvantage or advantage, The Traveling Merchant’s choice. The new roll replaces the previous roll, reshaping reality to accommodate the change."
					]
				}
			],
			"tokenUrl": "https://i.imgur.com/xSZjylB.png",
			"traitTags": [
				"Legendary Resistances",
				"Magic Weapons",
				"Regeneration"
			],
			"senseTags": [
				"U"
			],
			"actionTags": [
				"Multiattack"
			],
			"languageTags": [
				"XX",
				"TP"
			],
			"damageTags": [
				"P",
				"O"
			],
			"spellcastingTags": [
				"I"
			],
			"conditionInflictSpell": [
				"blinded",
				"charmed",
				"deafened",
				"restrained",
				"stunned"
			],
			"conditionInflicted": [
				"poisoned",
				"restrained",
				"grappled"
			],
			"fluff": {
				"entries": [
					"\"Time is irrelevant to those who are not bound by it, and yet you mortals yearn for it. I envy those who can run out of time.\"",
					"An endless wanderer throughout space and time, a creature not bound by the laws of mortals or gods. He is supposedly the being that represents time, or perhaps even the concept of it.",
					"His travels allow him to gain an assortment of items from throughout the multiverse and throughout all of time, if it has existed he can get his palms on it. While he could learn whatever he wants at any given time, he prefers to take his time learning about adventurers, learning through mere conversation instead.",
					"He rewards adventurers with interesting tales with magical items, though the items in question are random."
				],
				"images": [
					{
						"type": "image",
						"href": {
							"type": "external",
							"url": "https://i.imgur.com/sFT2Rny.jpg"
						}
					}
				]
			},
			"isNamedCreature": true,
			"legendaryActions": 10,
			"shortName": "Merchant",
			"reaction": [
				{
					"name": "Timestop {@recharge}",
					"entries": [
						"When The Traveling Merchant is hit with an attack, prior to being hit he can use his reaction to cast {@spell time stop}."
					]
				}
			],
			"skill": {
				"history": "+44",
				"insight": "+43",
				"arcana": "+44",
				"acrobatics": "+30",
				"animal handling": "+29",
				"athletics": "+26",
				"deception": "+34",
				"intimidation": "+34",
				"investigation": "+30",
				"medicine": "+29",
				"nature": "+30",
				"performance": "+34",
				"persuasion": "+34",
				"religion": "+30",
				"stealth": "+30",
				"sleight of hand": "+30",
				"survival": "+29",
				"perception": "+43"
			},
			"resist": [
				{
					"special": "all damage"
				}
			],
			"conditionImmune": [
				{
					"special": "all conditions"
				}
			],
			"conditionInflict": [
				"incapacitated"
			],
			"miscTags": [
				"RW",
				"MW"
			],
			"level": 60,
			"cr": "30"
		}
	]
}