{
  "_meta": {
    "sources": [
      {
        "json": "WayofTempest",
        "abbreviation": "MT:WoT",
        "full": "Way of the Tempest",
        "authors": [
          "Erikku Blade"
        ],
        "convertedBy": [
          "Erikku Blade"
        ],
        "version": "3.2",
        "url": "https://docs.google.com/document/d/1oHAnv77kX3EZ50_uCeLFhmi07LxvDOgzMiSjJU7mFYc/edit?usp=sharing",
        "targetSchema": "1.0.0"
      }
    ],
    "dateAdded": 1588106289,
    "dateLastModified": 1588106289
  },
  "subclass": [
    {
      "name": "Way of the Tempest",
      "subclassFeatures": [
        "Way of the Tempest|Monk||Tempest|WayofTempest|3",
        "Stormlord’s Protection|Monk||Tempest|WayofTempest|3",
        "Fists of the Storm|Monk||Tempest|WayofTempest|3",
        "Stormborn Weapons|Monk||Tempest|WayofTempest|3",
        "Storm Disciple|Monk||Tempest|WayofTempest|6",
        "Stormborn’s Tempest|Monk||Tempest|WayofTempest|11",
        "Overwhelming Storm|Monk||Tempest|WayofTempest|17"
      ],
      "source": "WayofTempest",
      "shortName": "Tempest",
      "className": "Monk",
      "classSource": "PHB"
    }
  ],
  "subclassFeature": [
    {
      "name": "Way of the Tempest",
      "source": "WayofTempest",
      "page": 80,
      "className": "Monk",
      "classSource": "PHB",
      "subclassShortName": "Tempest",
      "subclassSource": "WayofTempest",
      "level": 3,
      "entries": [
        "You follow a monastic tradition that teaches you to harness the power of the storm. When you focus your ki, you can align yourself with the storm inside you and bend them to your will, using them as an extension of your body.",
        "Many monks of this tradition tattoo their bodies with representations of their ki powers, commonly imagined as coiling dragons, but also as elder tempests and arcane sigils."
      ]
    },
    {
      "type": "entries",
      "name": "Stormlord’s Protection",
      "source": "WayofTempest",
      "page": 80,
      "className": "Monk",
      "classSource": "PHB",
      "subclassShortName": "Tempest",
      "subclassSource": "WayofTempest",
      "level": 3,
      "header": 1,
      "entries": [
        "Starting at 3rd level you gain resistance to lightning damage. At 10th level you gain resistance to thunder damage."
      ]
    },
    {
      "type": "entries",
      "name": "Fists of the Storm",
      "source": "WayofTempest",
      "page": 80,
      "className": "Monk",
      "classSource": "PHB",
      "subclassShortName": "Tempest",
      "subclassSource": "WayofTempest",
      "level": 3,
      "header": 1,
      "entries": [
        "Starting at 3rd level you can call upon the might of a raging tempest that lies deep within your soul. Your unarmed strikes deal an additional amount of lightning or thunder damage (your choice) equal to your martial arts die."
      ]
    },
    {
      "type": "entries",
      "name": "Stormborn Weapons",
      "source": "WayofTempest",
      "page": 80,
      "className": "Monk",
      "classSource": "PHB",
      "subclassShortName": "Tempest",
      "subclassSource": "WayofTempest",
      "level": 3,
      "header": 1,
      "entries": [
        "Also at 3rd level pick two weapons of your choice that lack the special property. You spend a 1 hour ritual concentrating on these weapons to channel your ki through them. When you do so, these weapons are considered Monk Weapons.",
        "When you deal damage with these weapons, you deal an additional amount of lightning or thunder damage (your choice) equal to your Wisdom Modifier. ",
        "In addition, these weapons are considered magical for the purposes of overcoming resistances to non-magical weapons. If you are not proficient in these weapons already, you gain that proficiency until the ritual ends. Any attempt to perform this ritual again instantly removes the benefits from the previous weapons you had made as your Stormborn Weapons."
      ]
    },
    {
      "type": "entries",
      "name": "Storm Disciple",
      "source": "WayofTempest",
      "page": 80,
      "className": "Monk",
      "classSource": "PHB",
      "subclassShortName": "Tempest",
      "subclassSource": "WayofTempest",
      "level": 6,
      "header": 2,
      "entries": [
        "Starting at 6th level, you can channel your inner storm into magical spells. You gain the Shocking Grasp and Thunderclap cantrips which uses Wisdom as your spellcasting ability. ",
        "In addition you have learned certain disciplines that allow you to cast spells using ki points. You have three disciplines of your choice as detailed below starting at level 6. You learn two additional disciplines of your choice at 11th and 17th levels. Whenever you learn a new discipline, you can also replace one discipline that you already know with a different discipline.",
        "See {@book chapter 10|PHB} of the Player's Handbook for the general rules of spellcasting. To cast one of these spells, you use its casting time and other rules, but you don't need to provide material components for it. When you cast a spell with a discipline, it is cast at the spell's lowest level unless otherwise specified. You use Wisdom for your Spellcasting Ability.",
        "Level 6 Disciplines:",
        {
          "type": "options",
          "entries": [
            {
              "type": "entries",
              "name": "Fist of Four Thunders",
              "entries": [
                "You slam your fists together in front of you, causing a thunderous boom that blows away everything around you. You can spend 1 ki point to cast thunderwave."
              ]
            },
            {
              "type": "entries",
              "name": "Relentless Shock",
              "entries": [
                "You condense your mystical energies together into a single mote of lightning of which you hurl at a single enemy. You can spend 1 ki point to cast witch bolt."
              ]
            },
            {
              "type": "entries",
              "name": "Booming Thunder",
              "entries": [
                "You summon forth a storm within your weapon, allowing you to impact your enemies with the might of thunder and lightning. You can spend 1 ki point to cast thunderous smite."
              ]
            },
            {
              "type": "entries",
              "name": "Dragon's Lightning",
              "entries": [
                "You can summon the ancient might of the breath of dragons. You can spend 2 ki points to cast dragon’s breath, but can only choose lightning damage."
              ]
            },
            {
              "type": "entries",
              "name": "Ire of the Storm",
              "entries": [
                "You can draw from the energies around you to conjure a small storm, of which you channel the flow of your ki through in order to strike your foes with lightning bolts. You can spend 3 ki points to cast the Call Lightning Spell."
              ]
            },
            {
              "type": "entries",
              "name": "Artemis's Lightning",
              "entries": [
                "You can channel raw ki into your ranged attacks, electrifying your shots. You can spend 3 ki points to cast the Lightning Arrow spell."
              ]
            },
            {
              "type": "entries",
              "name": "Chariot of the Elder Tempest",
              "entries": [
                "You call forth a mighty source of power from within you, unleashing a mighty bolt of electricity being carried by an elder tempest. You can spend 3 ki points to cast the lightning bolt spell."
              ]
            },
            {
              "type": "entries",
              "name": "Thor's Leap",
              "entries": [
                "You summon forth a mighty strength from within which allows you to burst through the tethers of the material plane, allowing you to make a thunderous step and appear in another position. You can spend 3 ki points to cast the thunder step spell."
              ]
            }
          ]
        },
        "Level 11 Disciplines:",
        {
          "type": "options",
          "entries": [
            {
              "type": "entries",
              "name": "Sphere of the Storm King",
              "entries": [
                "You conjure the power of ancient giant lords to summon forth a powerful storm condensed within a large sphere. You can spend 4 ki points to cast the storm sphere spell."
              ]
            },
            {
              "type": "entries",
              "name": "Overwhelming Surge",
              "entries": [
                "You can release outward a powerful force of electrifying power by letting loose the storm within you. You can spend 5 ki points to cast the destructive wave spell, but you replace the radiant damage with lightning instead."
              ]
            },
            {
              "type": "entries",
              "name": "Ballet of Storms",
              "entries": [
                "You perform a variety of stances that allows you to move at lightning speeds. You can spend 5 ki points to cast the steel wind strike spell, but deals your choice of thunder or lightning damage instead of force."
              ]
            },
            {
              "type": "entries",
              "name": "Fury of the Storms",
              "entries": [
                "You let loose a wild surge of electricity that jumps from one target to the next. You can spend 6 ki points to cast the chain lightning spell."
              ]
            },
            {
              "type": "entries",
              "name": "Ritual of the Storm Lord",
              "entries": [
                "You perform an ancient religious dance that unlocks hidden potential from within, allowing you to become one with the storms. You can spend 6 ki points to cast the Investiture of Wind spell, but the special action you use to create a cube of swirling wind deals your choice of thunder or lightning damage instead of bludgeoning, adopting a new appearance accordingly."
              ]
            },
            {
              "type": "entries",
              "name": "Revival Shock",
              "entries": [
                "You rub your hands together to generate a large amount of electric energy that you can use in a pinch to resurrect a dead comrade. You can spend 6 ki points to cast the revivify spell, however in order for the spell to succeed you must make a dc 16 Wisdom (Medicine) ability check. On a failed check, the spell fails and you lose the ki points used to cast the spell. The dc decreases by 2 for each successful death save the target had prior to dying.",
                "Once you reach 11th level in this class, you can spend additional ki points to increase the level of a discipline spell that you cast, provided that the spell has an enhanced effect at a higher level, as lightning bolt does. The spell's level increases by 1 for each additional ki point you spend. For example, if you are a 11th-level monk and use Chariot of the Elder Tempest to cast lightning bolt, you can spend 4 ki points to cast it as a 4th-level spell (the discipline's base cost of 3 ki point plus 1)."
              ]
            }
          ]
        },
        "The maximum number of ki points (its base ki point cost plus any additional points) that you can spend on the spell is 6, unless a discipline specifies otherwise."
      ]
    },
    {
      "type": "entries",
      "name": "Stormborn’s Tempest",
      "source": "WayofTempest",
      "page": 80,
      "className": "Monk",
      "classSource": "PHB",
      "subclassShortName": "Tempest",
      "subclassSource": "WayofTempest",
      "level": 11,
      "header": 2,
      "entries": [
        "At 11th level, as a bonus action you can spend 3 ki points to channel a powerful storm into a protective aura. You gain an amount of temporary hit points equal to twice your Wisdom Modifier at the start of each of your turns for 1 minute, you also gain these temporary hit points when you use this ability. While you have these temporary hit points, you gain the following benefits :",
        {
          "type": "list",
          "items": [
            "Creatures that hit you with melee attacks while within 5 ft of you take lightning or thunder damage (your choice) equal to twice your Wisdom Modifier.",
            "You have a +2 bonus to AC and Dexterity saving throws.",
            "Whenever you deal lightning or thunder damage, whether by a spell, weapon attack, or magical effect: you add an amount to the roll equal to your Wisdom Modifier.",
            "Once your Stormborn’s Tempest ends you cannot do so again until you have completed a long rest. In addition, you gain one level of exhaustion which can be restored after a short rest.",
            "Your Stormborn’s Tempest can be ended early if a Dispel Magic spell of 5th level or higher, or by similar magical effects is used on you targeting the Stormborn’s Tempest effect. You can also end it early as a bonus action, doing so does not give you a level of exhaustion as long as half the duration or more did not pass."
          ]
        }
      ]
    },
    {
      "type": "entries",
      "name": "Overwhelming Storm",
      "source": "WayofTempest",
      "page": 80,
      "className": "Monk",
      "classSource": "PHB",
      "subclassShortName": "Tempest",
      "subclassSource": "WayofTempest",
      "level": 17,
      "header": 2,
      "entries": [
        "Starting at 17th level your lightning has become so powerful, it has become effective against those who resist it. You ignore damage resistances and immunities to lightning and thunder damage. Creatures that were immune to lightning and thunder damage instead take half damage. ",
        "When you deal lightning damage to a creature with the Lightning Absorption feature, you can spend 4 ki points to ignore the absorption effect for that damage. ",
        "You can also spend additional ki points on your weapon attacks to add 1 extra martial arts die of lightning or thunder damage (your choice) to your attacks per point spent to a maximum of 5."
      ]
    }
  ]
}